int/resources/objectRepo/xmlTemplates/htng/HTNG2008BActivitySync/req_LocationNotification.xml

<soapenv:Envelope xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"  xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:typ="http://htng.org/PWS/2008B/SingleGuestItinerary/Activity/Types" xmlns:typ1="http://htng.org/PWS/2008B/SingleGuestItinerary/Common/Types">
   <soapenv:Header/>
   <soapenv:Body>
      <typ:LocationNotificationRequest locationNotificationStatus="?" otherLocationNotificationStatus="?">
         <typ:ReservationID source="?"/>
         <typ:ActivityTime>
            <typ1:Start/>
            <typ1:End/>
         </typ:ActivityTime>
         <typ:LocationText language="?"/>
         <typ:ProfileID source="?"/>
         <typ:Description language="?"/>
         <typ:ResortId/>
      </typ:LocationNotificationRequest>
   </soapenv:Body>
</soapenv:Envelope>